## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_event_source_mapping.this["sqs"] has changed
  ~ resource "aws_lambda_event_source_mapping" "this" {
+       function_response_types            = []
        id                                 = "ff691eed-bbe3-46e2-8bc6-5d67d8117489"
+       queues                             = []
+       topics                             = []
        # (15 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-05-08T19:06:51.000+0000" -> "2023-05-08T19:06:57.026+0000"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-05-08T19:06:57.026+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:2/invocations" -> (known after apply)
      ~ s3_key                         = "builds/de4e040452349a2d2fab95e776ee4aca799f4731fdc79a364603caeee28fec40.zip" -> "builds/410c1345795115b0087943bc9505a7cdf0de2f333c243f36e2272cbc02fd2f11.zip"
      ~ s3_object_version              = "XOYk2kWyGAZK6pXS14HFL6PnsMugOsp0" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:6a712f3b8e9146fac0cf9fdbcc4df5e19c5373c6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:552677e57bd999108cf31dbe2137747389509bb9,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "6a712f3b8e9146fac0cf9fdbcc4df5e19c5373c6" -> "552677e57bd999108cf31dbe2137747389509bb9"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-DownloadFFISSpreadsheet"
+       id                  = (known after apply)
+       principal           = "sqs.amazonaws.com"
+       qualifier           = (known after apply)
+       statement_id        = "SQSQueueNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["SQSQueueNotification"] will be created
+   resource "aws_lambda_permission" "unqualified_alias_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-DownloadFFISSpreadsheet"
+       id                  = (known after apply)
+       principal           = "sqs.amazonaws.com"
+       statement_id        = "SQSQueueNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "39b87b97544955d746de3b4c05625b4d-2" -> (known after apply)
      ~ id                     = "builds/de4e040452349a2d2fab95e776ee4aca799f4731fdc79a364603caeee28fec40.zip" -> (known after apply)
      ~ key                    = "builds/de4e040452349a2d2fab95e776ee4aca799f4731fdc79a364603caeee28fec40.zip" -> "builds/410c1345795115b0087943bc9505a7cdf0de2f333c243f36e2272cbc02fd2f11.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/de4e040452349a2d2fab95e776ee4aca799f4731fdc79a364603caeee28fec40.zip" -> "builds/410c1345795115b0087943bc9505a7cdf0de2f333c243f36e2272cbc02fd2f11.zip"
-       tags                   = {} -> null
      ~ version_id             = "XOYk2kWyGAZK6pXS14HFL6PnsMugOsp0" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/410c1345795115b0087943bc9505a7cdf0de2f333c243f36e2272cbc02fd2f11.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/410c1345795115b0087943bc9505a7cdf0de2f333c243f36e2272cbc02fd2f11.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6578699202363967944" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/de4e040452349a2d2fab95e776ee4aca799f4731fdc79a364603caeee28fec40.zip" -> "builds/410c1345795115b0087943bc9505a7cdf0de2f333c243f36e2272cbc02fd2f11.zip"
          ~ "timestamp" = "1683572597360874800" -> "1683574268028702000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7014282657721023117" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/de4e040452349a2d2fab95e776ee4aca799f4731fdc79a364603caeee28fec40.zip" -> "builds/410c1345795115b0087943bc9505a7cdf0de2f333c243f36e2272cbc02fd2f11.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-05-08T19:06:51.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:27" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:27/invocations" -> (known after apply)
      ~ s3_key                         = "builds/756c4a6bac0c62b8d4ff20fcfeb94970a00e0a1f6df97a0b90cb0bbc75442c25.zip" -> "builds/0f904c081cf53373a3bb5876a482d6f31ab1cdb50af0fcf468b22bb9102c92a9.zip"
      ~ s3_object_version              = "Wfnc2rPYd1NO6p_81rNfWKR3xWLjoX2n" -> (known after apply)
        tags                           = {}
      ~ version                        = "27" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:6a712f3b8e9146fac0cf9fdbcc4df5e19c5373c6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:552677e57bd999108cf31dbe2137747389509bb9,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "6a712f3b8e9146fac0cf9fdbcc4df5e19c5373c6" -> "552677e57bd999108cf31dbe2137747389509bb9"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "27" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1798d0fcbe3ac165edfe50d5b8bc9067-2" -> (known after apply)
      ~ id                     = "builds/756c4a6bac0c62b8d4ff20fcfeb94970a00e0a1f6df97a0b90cb0bbc75442c25.zip" -> (known after apply)
      ~ key                    = "builds/756c4a6bac0c62b8d4ff20fcfeb94970a00e0a1f6df97a0b90cb0bbc75442c25.zip" -> "builds/0f904c081cf53373a3bb5876a482d6f31ab1cdb50af0fcf468b22bb9102c92a9.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/756c4a6bac0c62b8d4ff20fcfeb94970a00e0a1f6df97a0b90cb0bbc75442c25.zip" -> "builds/0f904c081cf53373a3bb5876a482d6f31ab1cdb50af0fcf468b22bb9102c92a9.zip"
-       tags                   = {} -> null
      ~ version_id             = "Wfnc2rPYd1NO6p_81rNfWKR3xWLjoX2n" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/0f904c081cf53373a3bb5876a482d6f31ab1cdb50af0fcf468b22bb9102c92a9.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/0f904c081cf53373a3bb5876a482d6f31ab1cdb50af0fcf468b22bb9102c92a9.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "9126897855448809402" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/756c4a6bac0c62b8d4ff20fcfeb94970a00e0a1f6df97a0b90cb0bbc75442c25.zip" -> "builds/0f904c081cf53373a3bb5876a482d6f31ab1cdb50af0fcf468b22bb9102c92a9.zip"
          ~ "timestamp" = "1683572584684294000" -> "1683574253038419000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8812151281248966352" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/756c4a6bac0c62b8d4ff20fcfeb94970a00e0a1f6df97a0b90cb0bbc75442c25.zip" -> "builds/0f904c081cf53373a3bb5876a482d6f31ab1cdb50af0fcf468b22bb9102c92a9.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-05-08T19:06:51.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:7/invocations" -> (known after apply)
      ~ s3_key                         = "builds/19b452967bb80ac3f07f0ae8879440ee01c9f6e54fbe7cf93d12f3551ec41dc3.zip" -> "builds/f1138e5bc8039d5ab69479ad60ee0dfe98455b89f03609317b2c86a48b2f16a6.zip"
      ~ s3_object_version              = "soi1nov3dKIx3Sf_gTLct1GyamyjgYRO" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:6a712f3b8e9146fac0cf9fdbcc4df5e19c5373c6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:552677e57bd999108cf31dbe2137747389509bb9,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "6a712f3b8e9146fac0cf9fdbcc4df5e19c5373c6" -> "552677e57bd999108cf31dbe2137747389509bb9"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "7" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "cd21c44f4f864258ca78f5631ed06238-2" -> (known after apply)
      ~ id                     = "builds/19b452967bb80ac3f07f0ae8879440ee01c9f6e54fbe7cf93d12f3551ec41dc3.zip" -> (known after apply)
      ~ key                    = "builds/19b452967bb80ac3f07f0ae8879440ee01c9f6e54fbe7cf93d12f3551ec41dc3.zip" -> "builds/f1138e5bc8039d5ab69479ad60ee0dfe98455b89f03609317b2c86a48b2f16a6.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/19b452967bb80ac3f07f0ae8879440ee01c9f6e54fbe7cf93d12f3551ec41dc3.zip" -> "builds/f1138e5bc8039d5ab69479ad60ee0dfe98455b89f03609317b2c86a48b2f16a6.zip"
-       tags                   = {} -> null
      ~ version_id             = "soi1nov3dKIx3Sf_gTLct1GyamyjgYRO" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/f1138e5bc8039d5ab69479ad60ee0dfe98455b89f03609317b2c86a48b2f16a6.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f1138e5bc8039d5ab69479ad60ee0dfe98455b89f03609317b2c86a48b2f16a6.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7143495521486298897" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/19b452967bb80ac3f07f0ae8879440ee01c9f6e54fbe7cf93d12f3551ec41dc3.zip" -> "builds/f1138e5bc8039d5ab69479ad60ee0dfe98455b89f03609317b2c86a48b2f16a6.zip"
          ~ "timestamp" = "1683572597240203000" -> "1683574268023988000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "542523469250829473" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/19b452967bb80ac3f07f0ae8879440ee01c9f6e54fbe7cf93d12f3551ec41dc3.zip" -> "builds/f1138e5bc8039d5ab69479ad60ee0dfe98455b89f03609317b2c86a48b2f16a6.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-05-08T19:06:51.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:26" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:26/invocations" -> (known after apply)
      ~ s3_key                         = "builds/35147c2f92ee09528a29bc55989feaf1117e87f8eb4bf0aeaf68c193a410deb2.zip" -> "builds/2f3c3b21a9fe456452a2adeeb372c46a48354be8f9687bdd983284880d333952.zip"
      ~ s3_object_version              = "CBXzdgx8qUgNwlDkWn6VK1YFWjBn6Rv3" -> (known after apply)
        tags                           = {}
      ~ version                        = "26" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:6a712f3b8e9146fac0cf9fdbcc4df5e19c5373c6,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:552677e57bd999108cf31dbe2137747389509bb9,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "6a712f3b8e9146fac0cf9fdbcc4df5e19c5373c6" -> "552677e57bd999108cf31dbe2137747389509bb9"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "26" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f880291130b645b8824ddfdad7d5dfcb-2" -> (known after apply)
      ~ id                     = "builds/35147c2f92ee09528a29bc55989feaf1117e87f8eb4bf0aeaf68c193a410deb2.zip" -> (known after apply)
      ~ key                    = "builds/35147c2f92ee09528a29bc55989feaf1117e87f8eb4bf0aeaf68c193a410deb2.zip" -> "builds/2f3c3b21a9fe456452a2adeeb372c46a48354be8f9687bdd983284880d333952.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/35147c2f92ee09528a29bc55989feaf1117e87f8eb4bf0aeaf68c193a410deb2.zip" -> "builds/2f3c3b21a9fe456452a2adeeb372c46a48354be8f9687bdd983284880d333952.zip"
-       tags                   = {} -> null
      ~ version_id             = "CBXzdgx8qUgNwlDkWn6VK1YFWjBn6Rv3" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/2f3c3b21a9fe456452a2adeeb372c46a48354be8f9687bdd983284880d333952.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/2f3c3b21a9fe456452a2adeeb372c46a48354be8f9687bdd983284880d333952.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6125529187599928682" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/35147c2f92ee09528a29bc55989feaf1117e87f8eb4bf0aeaf68c193a410deb2.zip" -> "builds/2f3c3b21a9fe456452a2adeeb372c46a48354be8f9687bdd983284880d333952.zip"
          ~ "timestamp" = "1683572584571801000" -> "1683574253218347000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1257759280333209955" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/35147c2f92ee09528a29bc55989feaf1117e87f8eb4bf0aeaf68c193a410deb2.zip" -> "builds/2f3c3b21a9fe456452a2adeeb372c46a48354be8f9687bdd983284880d333952.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 21 to add, 8 to change, 15 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4918859054)*